# Trabalhando com Planilhas de Excel

In [1]:
# Import statements
import pandas as pd

In [4]:
# Loading the data
df_1 = pd.read_excel('./Curso_Python_Pandas_Digital_Innovation-master/datasets/Aracaju.xlsx')
df_2 = pd.read_excel('./Curso_Python_Pandas_Digital_Innovation-master/datasets/Fortaleza.xlsx')
df_3 = pd.read_excel('./Curso_Python_Pandas_Digital_Innovation-master/datasets/Natal.xlsx')
df_4 = pd.read_excel('./Curso_Python_Pandas_Digital_Innovation-master/datasets/Recife.xlsx')
df_5 = pd.read_excel('./Curso_Python_Pandas_Digital_Innovation-master/datasets/Salvador.xlsx')

In [3]:
df_1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [5]:
df_2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [6]:
df_3.head()

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3

In [7]:
df_4.head()

   Cidade       Data  Vendas  LojaID  Qtde
0  Recife 2019-01-01  162.61     981     1
1  Recife 2019-01-01   11.44     983     1
2  Recife 2019-02-10   12.94     983     5
3  Recife 2019-02-10  160.54     981     3
4  Recife 2019-02-14   19.89     983     7

In [8]:
df_5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [9]:
# Concatenation of the datasets into a single DataFrame
df = pd.concat([df_1, df_2, df_3, df_4, df_5])

In [10]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [11]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [14]:
# Sampling our DataFrame
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
103   Aracaju 2018-01-01   12.62    1522     3
180     Natal 2019-01-02  116.63    1035     2
1    Salvador 2018-01-01   19.02    1034     3
129    Recife 2019-03-02   35.34     982     7
10      Natal 2018-10-27  828.00     852     4

In [13]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [17]:
# Changing the type of LojaID column
df.LojaID = df.LojaID.astype("object")

In [18]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

## Tratando valores nulos

In [21]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

Caso tivéssemos dados faltantes em Vendas, por exemplo,substituir tais valores usando o método `fillna()`:

* poderíamos pela média:
```python
df.Vendas.fillna(df.Vendas.mean(), inplace=True)
```

* substituir por zero:
```python
df.Vendas.fillna(0, inplace=True)
```

Também poderíamos "*dropar*" as linhas com dados faltantes usando o método `dropna()`:

* todas as linhas que tiverem ao menos um valor faltante:
```python
df.dropna(inplace=True)
```

* linhas que tiverem um campo específico faltante (por exemplo `Vendas`):
```python
df.dropna(subset=['Vendas'], inplace=True)
```

* linhas com todas as entradas faltantes:
```python
df.dropna(how='all', inplace=True)
```

## Criando colunas

In [22]:
df['Receita'] = df.Vendas.mul(df.Qtde)
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [25]:
## Another way to perform multiplication:
df["Receita2"] = df.Vendas * df.Qtde

In [26]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita2
0  Aracaju 2018-01-01  142.00   1520     1   142.00    142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26     85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55     71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07     21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08    196.08

In [36]:
## Erasing (or "dropping") columns
df.drop('Receita2', axis=1, inplace=True)

## Investigando os dados

In [38]:
## Returns the three largest revenue
df.nlargest(3, 'Receita')

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [39]:
df.nsmallest(3, 'Receita')

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [40]:
## Max. revenue
df.Receita.max()

3544.0

In [41]:
## Min. revenue
df.Receita.min()

3.34

In [42]:
df.Receita.mean()

387.4977404921702

In [43]:
df.groupby('Cidade').Receita.sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [44]:
df.sort_values('Receita', ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
55  Natal 2019-01-08   859.0    854     4   3436.0
51  Natal 2018-01-21   859.0    852     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0
38  Natal 2018-02-25   828.0    852     4   3312.0
10  Natal 2018-10-27   828.0    852     4   3312.0
69  Natal 2019-03-24   817.0    852     4   3268.0
62  Natal 2018-02-10   793.0    854     4   3172.0
52  Natal 2018-04-27   778.0    854     4   3112.0